"use client";

import Script from "next/script";
import { useEffect, useState } from "react";
import Papa from "papaparse";

export default function KakaoMapPage() {
  const [isLoaded, setIsLoaded] = useState(false);
  const [map, setMap] = useState<any>(null);
  const [streetTree, setStreetTree] = useState<{ lat: number; lng: number }[]>(
    []
  );

  // 가로수 CSV 불러오기
  useEffect(() => {
    fetch("/streetTree.csv")
      .then((res) => res.text())
      .then((text) => {
        Papa.parse(text, {
          header: true,
          skipEmptyLines: true,
          complete: function (results) {
            const parsed = results.data as any[];
            const points = parsed.map((row) => ({
              lat: parseFloat(row["수목위도"]),
              lng: parseFloat(row["수목경도"]),
            }));
            setStreetTree(points);
          },
        });
      });
  }, []);

  // 지도 초기화
  const initMap = () => {
    const container = document.getElementById("map");
    const options = {
      center: new window.kakao.maps.LatLng(37.5744, 127.0395),
      level: 4,
    };

    const newMap = new window.kakao.maps.Map(container, options);
    setMap(newMap);

    // 중심 마커
    const centerPosition = new window.kakao.maps.LatLng(37.5744, 127.0395);
    new window.kakao.maps.Marker({
      position: centerPosition,
      map: newMap,
    });

    // 💙 학교 마커
    const markerPositions = [
      { lat: 37.5739950231496, lng: 127.073890977298, title: "서울장평초" },
      { lat: 37.5923093987643, lng: 127.055908478798, title: "서울청량초" },
      { lat: 37.6018964867149, lng: 127.064885003959, title: "서울이문초" },
      { lat: 37.5764049847235, lng: 127.0283819823, title: "서울용두초" },
      { lat: 37.5688043221289, lng: 127.055427038114, title: "서울답십리초" },
      { lat: 37.586120384461, lng: 127.039414975087, title: "서울홍파초" },
      { lat: 37.5641223174494, lng: 127.060523298508, title: "서울군자초" },
      { lat: 37.5746852353644, lng: 127.054397292161, title: "서울전농초" },
      { lat: 37.58008416213, lng: 127.066871936075, title: "서울배봉초" },
      { lat: 37.5784502701654, lng: 127.076003088926, title: "은석초" },
      { lat: 37.5896941349867, lng: 127.0482485373, title: "서울삼육초" },
      { lat: 37.5807042921469, lng: 127.056012445216, title: "서울전곡초" },
      { lat: 37.5823074106355, lng: 127.031856383108, title: "서울종암초" },
      { lat: 37.5727046089059, lng: 127.042961687519, title: "서울신답초" },
      { lat: 37.5715014215127, lng: 127.06403409435, title: "서울동답초" },
      { lat: 37.5906875196186, lng: 127.047705124334, title: "서울홍릉초" },
      { lat: 37.5790832853249, lng: 127.060805297019, title: "서울전동초" },
      { lat: 37.565968213548, lng: 127.072033422513, title: "서울안평초" },
      { lat: 37.5856754144498, lng: 127.057916891964, title: "서울휘경초" },
      { lat: 37.5939491407769, lng: 127.054890960564, title: "경희초" },
      { lat: 37.5856764110055, lng: 127.070041638322, title: "서울휘봉초" },
      { lat: 37.5939491407769, lng: 127.054890960564, title: "경희중" },
      { lat: 37.5738482581785, lng: 127.043896480723, title: "숭인중" },
      { lat: 37.5882192071931, lng: 127.050622549806, title: "청량중" },
      { lat: 37.5668596067189, lng: 127.070477570556, title: "장평중" },
      { lat: 37.5818502321361, lng: 127.033850440748, title: "성일중" },
      { lat: 37.5745220668493, lng: 127.051994343436, title: "동대문중" },
      { lat: 37.5825001768201, lng: 127.058379516351, title: "전일중" },
      { lat: 37.5819005156881, lng: 127.067434080061, title: "휘경여중" },
      { lat: 37.5870929876308, lng: 127.061746113577, title: "휘경중" },
      { lat: 37.5779549391135, lng: 127.025328234604, title: "대광중" },
      { lat: 37.586048641672, lng: 127.041070321981, title: "정화여중" },
      { lat: 37.5861935915453, lng: 127.070929087368, title: "전동중" },
      { lat: 37.5820442761539, lng: 127.059279434844, title: "전농중" },
      {
        lat: 37.5780471818476,
        lng: 127.075133018965,
        title: "동국대학교사범대학 부속중",
      },
      { lat: 37.5939491407769, lng: 127.054890960564, title: "경희여중" },
      { lat: 37.5939491407769, lng: 127.054890960564, title: "경희여고" },
      { lat: 37.5777320687093, lng: 127.047655876816, title: "청량정보고" },
      {
        lat: 37.5818725994505,
        lng: 127.056976879173,
        title: "해성국제컨벤션고",
      },
      { lat: 37.5821227010138, lng: 127.047209103701, title: "정암미용고" },
      { lat: 37.5818725994505, lng: 127.056976879173, title: "해성여자고" },
      { lat: 37.586048641672, lng: 127.041070321981, title: "서울정화고" },
      { lat: 37.5851530128648, lng: 127.069450940954, title: "서울반도체고" },
      { lat: 37.5939491407769, lng: 127.054890960564, title: "경희고" },
      { lat: 37.5888860047887, lng: 127.051310950177, title: "청량고" },
      { lat: 37.5863723553049, lng: 127.068940658438, title: "휘봉고" },
      { lat: 37.5819005156881, lng: 127.067434080061, title: "휘경여자고" },
      { lat: 37.5779549391135, lng: 127.025328234604, title: "대광고" },
      {
        lat: 37.5780471818476,
        lng: 127.075133018965,
        title: "동국대학교 사범대학 부속고",
      },
      { lat: 37.5751432705208, lng: 127.071666424993, title: "새일문유치원" },
      { lat: 37.5806284683372, lng: 127.052798088901, title: "백주유치원" },
      { lat: 37.5773472429026, lng: 127.064386983555, title: "예일유치원" },
      { lat: 37.5755060418781, lng: 127.049695860484, title: "삼성유치원" },
      {
        lat: 37.5790832853249,
        lng: 127.060805297019,
        title: "서울전동초등학교병설유치원",
      },
      { lat: 37.5883932941526, lng: 127.039218485863, title: "자람유치원" },
      { lat: 37.5856754144498, lng: 127.057916891964, title: "서울휘경유치원" },
      { lat: 37.5722517408702, lng: 127.060502369282, title: "한양유치원" },
      { lat: 37.5710568281709, lng: 127.075113657819, title: "세하유치원" },
      { lat: 37.6007507501532, lng: 127.068769452719, title: "서울유치원" },
      { lat: 37.5651958543852, lng: 127.063775155288, title: "사군자유치원" },
      { lat: 37.5926776807408, lng: 127.054067865832, title: "산정현유치원" },
      { lat: 37.5746094744702, lng: 127.060129124176, title: "파스텔유치원" },
      { lat: 37.5731026565696, lng: 127.031584630503, title: "신동아유치원" },
      { lat: 37.5828193166314, lng: 127.068739369277, title: "아이비유치원" },
      { lat: 37.5880281566858, lng: 127.049226158581, title: "사랑유치원" },
      { lat: 37.5929409000658, lng: 127.059420443026, title: "젬마유치원" },
      { lat: 37.5830669346508, lng: 127.034777091582, title: "소화유치원" },
      { lat: 37.570069317441, lng: 127.059860257139, title: "그림유치원" },
      { lat: 37.5904911969788, lng: 127.041496116551, title: "홍릉유치원" },
      {
        lat: 37.5739950231496,
        lng: 127.073890977298,
        title: "서울장평초등학교병설유치원",
      },
      { lat: 37.5945383139746, lng: 127.064317773941, title: "규전유치원" },
      {
        lat: 37.586120384461,
        lng: 127.039414975087,
        title: "서울홍파초등학교병설유치원",
      },
      {
        lat: 37.5856764110055,
        lng: 127.070041638322,
        title: "서울휘봉초등학교병설유치원",
      },
      { lat: 37.5766590358858, lng: 127.061567688813, title: "새소리유치원" },
      {
        lat: 37.5688043221289,
        lng: 127.055427038114,
        title: "서울답십리초등학교병설유치원",
      },
      {
        lat: 37.5641223174494,
        lng: 127.060523298508,
        title: "서울군자초등학교병설유치원",
      },
      { lat: 37.5925383443867, lng: 127.056844152107, title: "동안유치원" },
      { lat: 37.5791219819217, lng: 127.053850210023, title: "빛나유치원" },
      { lat: 37.5939491407769, lng: 127.054890960564, title: "경희유치원" },
      { lat: 37.6018964867149, lng: 127.064885003959, title: "서울이문유치원" },
      { lat: 37.5790073735728, lng: 127.075833615308, title: "정원유치원" },
      {
        lat: 37.5807042921469,
        lng: 127.056012445216,
        title: "서울전곡초등학교병설유치원",
      },
      { lat: 37.5702600120377, lng: 127.057598419026, title: "라온유치원" },
      { lat: 37.5826703077969, lng: 127.034809512872, title: "가람어린이집" },
      { lat: 37.5630691100573, lng: 127.069116799927, title: "가온어린이집" },
      {
        lat: 37.5937443884234,
        lng: 127.053223139329,
        title: "경희대학교직장어린이집",
      },
      {
        lat: 37.5934496635461,
        lng: 127.050161166654,
        title: "경희의료원 어린이집",
      },
      { lat: 37.6007507501532, lng: 127.068769452719, title: "규현어린이집" },
      {
        lat: 37.5775880431542,
        lng: 127.042841437254,
        title: "그라시엘어린이집",
      },
      { lat: 37.5862119387672, lng: 127.06355328121, title: "그린어린이집" },
      { lat: 37.5750602669676, lng: 127.041684865419, title: "글샘어린이집" },
      { lat: 37.5776689312604, lng: 127.073145743574, title: "길터어린이집" },
      { lat: 37.5703967570742, lng: 127.068448809636, title: "꼬꼬마어린이집" },
      { lat: 37.5633286766681, lng: 127.068516365557, title: "꼬마별어린이집" },
      {
        lat: 37.5728549565736,
        lng: 127.052401156065,
        title: "꼬마숲아띠어린이집",
      },
      { lat: 37.5750720968253, lng: 127.074282139153, title: "꿀벌어린이집" },
      { lat: 37.5766590358858, lng: 127.061567688813, title: "꿈동산어린이집" },
      { lat: 37.5728549565736, lng: 127.052401156065, title: "꿈동이어린이집" },
      { lat: 37.5710568281709, lng: 127.075113657819, title: "꿈둥이어린이집" },
      { lat: 37.5855023686525, lng: 127.054043541688, title: "꿈마루어린이집" },
      { lat: 37.6007507501532, lng: 127.068769452719, title: "꿈쟁이어린이집" },
      {
        lat: 37.5767163112994,
        lng: 127.049782134969,
        title: "노블레스어린이집",
      },
      {
        lat: 37.5763379008361,
        lng: 127.074572635161,
        title: "누리보듬어린이집",
      },
      {
        lat: 37.5755060418781,
        lng: 127.049695860484,
        title: "느티나무어린이집",
      },
      { lat: 37.5916037201805, lng: 127.062931601394, title: "늘봄어린이집" },
      { lat: 37.5841999794101, lng: 127.049102948529, title: "늘사랑어린이집" },
      { lat: 37.5720742467292, lng: 127.047273509268, title: "늘푸른어린이집" },
      { lat: 37.5710568281709, lng: 127.075113657819, title: "다사랑어린이집" },
      { lat: 37.5755060418781, lng: 127.049695860484, title: "다온어린이집" },
      { lat: 37.5755060418781, lng: 127.049695860484, title: "다함어린이집" },
      { lat: 37.5751633645646, lng: 127.047579638931, title: "단비어린이집" },
      { lat: 37.6049031022538, lng: 127.063706436409, title: "대림 어린이집" },
      {
        lat: 37.5711406437048,
        lng: 127.064400996804,
        title: "대림늘푸른어린이집",
      },
      {
        lat: 37.5755519113019,
        lng: 127.06699625602,
        title: "더불어숲어린이집",
      },
      { lat: 37.573110330347, lng: 127.069601745357, title: "데시앙어린이집" },
      { lat: 37.5787795328827, lng: 127.059800662877, title: "도담어린이집" },
      {
        lat: 37.5648696383895,
        lng: 127.062360937768,
        title: "동그라미어린이집",
      },
      {
        lat: 37.575323586988,
        lng: 127.039172801787,
        title: "동대문구청직장어린이집",
      },
      { lat: 37.571191352366, lng: 127.051184932115, title: "동대문어린이집" },
      {
        lat: 37.569890008745,
        lng: 127.061631957974,
        title: "동아개구쟁이어린이집",
      },
      { lat: 37.569890008745, lng: 127.061631957974, title: "동아어린이집" },
      {
        lat: 37.5890453957672,
        lng: 127.060259620825,
        title: "동화마을어린이집",
      },
      { lat: 37.5887014845076, lng: 127.060264438629, title: "동화어린이집" },
      {
        lat: 37.5991201612927,
        lng: 127.060849796043,
        title: "라그란데꿈별어린이집",
      },
      {
        lat: 37.599823362368,
        lng: 127.061241161796,
        title: "라그란데슬하어린이집",
      },
      {
        lat: 37.599823362368,
        lng: 127.061241161796,
        title: "라그란데은하수어린이집",
      },
      { lat: 37.5734678565527, lng: 127.035306481469, title: "라온어린이집" },
      {
        lat: 37.5728549565736,
        lng: 127.052401156065,
        title: "래미안위브어린이집",
      },
      {
        lat: 37.5794976614097,
        lng: 127.030492933066,
        title: "리치예성어린이집",
      },
      { lat: 37.5717153101844, lng: 127.076044353452, title: "메꽃어린이집" },
      {
        lat: 37.5733430631896,
        lng: 127.055281769593,
        title: "미드카운티어린이집",
      },
      {
        lat: 37.5804396384081,
        lng: 127.070226360962,
        title: "미소가득한어린이집",
      },
      {
        lat: 37.585795975342,
        lng: 127.046260607883,
        title: "미주키즈어린이집",
      },
      { lat: 37.5811608197249, lng: 127.070635734566, title: "배봉어린이집" },
      { lat: 37.5723432877087, lng: 127.068567978354, title: "별밭어린이집" },
      { lat: 37.5710568281709, lng: 127.075113657819, title: "별초롱어린이집" },
      { lat: 37.5978134973025, lng: 127.065482975741, title: "보림어린이집" },
      {
        lat: 37.5710568281709,
        lng: 127.075113657819,
        title: "브레인에듀어린이집",
      },
      { lat: 37.5791219819217, lng: 127.053850210023, title: "빛나어린이집" },
      { lat: 37.5779675484397, lng: 127.063441896132, title: "빛초롱어린이집" },
      { lat: 37.5651093012247, lng: 127.063881591368, title: "사군자어린이집" },
      { lat: 37.5930356072908, lng: 127.060984794097, title: "사랑샘어린이집" },
      { lat: 37.5883932941526, lng: 127.039218485863, title: "사랑어린이집" },
      { lat: 37.603660660258, lng: 127.070026447776, title: "사랑해어린이집" },
      { lat: 37.5712875989328, lng: 127.06824485099, title: "삼성어린이집" },
      { lat: 37.58280297036, lng: 127.055452585633, title: "삼성영재어린이집" },
      {
        lat: 37.5862119387672,
        lng: 127.06355328121,
        title: "삼육서울병원직장어린이집",
      },
      { lat: 37.5832360364758, lng: 127.071898008969, title: "새싹어린이집" },
      { lat: 37.5876923033213, lng: 127.05368892811, title: "새하늘어린이집" },
      { lat: 37.5883932941526, lng: 127.039218485863, title: "샘터어린이집" },
      {
        lat: 37.5825775765293,
        lng: 127.059988126984,
        title: "서울시립대학교직장어린이집",
      },
      { lat: 37.5899979987381, lng: 127.06553172159, title: "세빛어린이집" },
      { lat: 37.5728549565736, lng: 127.052401156065, title: "솔샘숲어린이집" },
      { lat: 37.5820674007335, lng: 127.074159232857, title: "솔솔어린이집" },
      { lat: 37.5683341759006, lng: 127.071971407361, title: "솔향기어린이집" },
      { lat: 37.5750720968253, lng: 127.074282139153, title: "송림어린이집" },
      { lat: 37.5792492672171, lng: 127.045331070581, title: "스카이어린이집" },
      { lat: 37.5967735276868, lng: 127.064913280434, title: "신나는어린이집" },
      { lat: 37.5901684571627, lng: 127.05156387144, title: "신현대어린이집" },
      { lat: 37.5779549391135, lng: 127.025328234604, title: "아뜰어린이집" },
      { lat: 37.5668181232225, lng: 127.072180369911, title: "아라어린이집" },
      {
        lat: 37.5665636427987,
        lng: 127.059842623827,
        title: "아르테포레어린이집",
      },
      { lat: 37.5713911532894, lng: 127.063004129431, title: "아이꿈어린이집" },
      { lat: 37.5668181232225, lng: 127.072180369911, title: "아라어린이집" },
      {
        lat: 37.5798417442215,
        lng: 127.026808531973,
        title: "엘리니티어린이집",
      },
      { lat: 37.5760786999487, lng: 127.070440523729, title: "연세어린이집" },
      {
        lat: 37.5782603928595,
        lng: 127.060658702909,
        title: "열린방과후어린이집",
      },
      { lat: 37.5766593234367, lng: 127.047035619751, title: "영신어린이집" },
      { lat: 37.5857459123073, lng: 127.039473311969, title: "예나어린이집" },
      { lat: 37.5731026565696, lng: 127.031584630503, title: "예닮어린이집" },
      { lat: 37.5688266327284, lng: 127.071720138684, title: "예든어린이집" },
      { lat: 37.5749076420442, lng: 127.055085613697, title: "예뜰어린이집" },
      { lat: 37.5728549565736, lng: 127.052401156065, title: "예은어린이집" },
      { lat: 37.6049031022538, lng: 127.063706436409, title: "예일어린이집" },
      { lat: 37.5755060418781, lng: 127.049695860484, title: "예지슬어린이집" },
      { lat: 37.5763379008361, lng: 127.074572635161, title: "예지어린이집" },
      { lat: 37.5794357911595, lng: 127.03141681182, title: "용두동어린이집" },
      {
        lat: 37.5796826388654,
        lng: 127.026363333093,
        title: "용두희망어린이집",
      },
      {
        lat: 37.5832421212008,
        lng: 127.047816079107,
        title: "우리누리어린이집",
      },
      {
        lat: 37.5750621283917,
        lng: 127.066522402213,
        title: "우성그린어린이집",
      },
      { lat: 37.5711423064389, lng: 127.057701202252, title: "우아세어린이집" },
      { lat: 37.5665625256918, lng: 127.057188313736, title: "위브어린이집" },
      { lat: 37.5882337488082, lng: 127.047052186477, title: "유마어린이집" },
      { lat: 37.6031629394921, lng: 127.063354117613, title: "이문어린이집" },
      {
        lat: 37.6012567008701,
        lng: 127.069768152771,
        title: "이문현대어린이집",
      },
      { lat: 37.5883932941526, lng: 127.039218485863, title: "이솝어린이집" },
      {
        lat: 37.6049031022538,
        lng: 127.063706436409,
        title: "이편한오렌지어린이집",
      },
      { lat: 37.5700719269179, lng: 127.072704548522, title: "이화어린이집" },
      { lat: 37.5763245487038, lng: 127.065813277511, title: "자연어린이집" },
      { lat: 37.5641124204702, lng: 127.069497391137, title: "장안어린이집" },
      {
        lat: 37.5710568281709,
        lng: 127.075113657819,
        title: "장안현대어린이집",
      },
      {
        lat: 37.5766676769978,
        lng: 127.055016043596,
        title: "전농방과후어린이집",
      },
      {
        lat: 37.5750720968253,
        lng: 127.074282139153,
        title: "조앤아이어린이집",
      },
      { lat: 37.5697768024358, lng: 127.059248769922, title: "조은어린이집" },
      {
        lat: 37.6040334801759,
        lng: 127.066778762818,
        title: "중앙삐아제어린이집",
      },
      { lat: 37.5766590358858, lng: 127.061567688813, title: "중앙어린이집" },
      { lat: 37.5766590358858, lng: 127.061567688813, title: "즐거운어린이집" },
      { lat: 37.568366951236, lng: 127.059016060525, title: "지니맘어린이집" },
      {
        lat: 37.5880281566858,
        lng: 127.049226158581,
        title: "천사나라어린이집",
      },
      {
        lat: 37.5864153011557,
        lng: 127.046987185633,
        title: "천응방과후어린이집",
      },
      {
        lat: 37.5722901232255,
        lng: 127.029916868494,
        title: "청계포레어린이집",
      },
      { lat: 37.5861958030225, lng: 127.040986280458, title: "청량리어린이집" },
      { lat: 37.5746094744702, lng: 127.060129124176, title: "청솔어린이집" },
      { lat: 37.5715355323262, lng: 127.04615896391, title: "청아어린이집" },
      {
        lat: 37.573837565013,
        lng: 127.045486724541,
        title: "초롱하나어린이집",
      },
      {
        lat: 37.5750720968253,
        lng: 127.074282139153,
        title: "칼비테영재어린이집",
      },
      {
        lat: 37.5826703077969,
        lng: 127.034809512872,
        title: "키즈브라운어린이집",
      },
      {
        lat: 37.5909683833441,
        lng: 127.068673152616,
        title: "킨더베베어린이집",
      },
      {
        lat: 37.5740562919533,
        lng: 127.045342412457,
        title: "태양하나어린이집",
      },
      { lat: 37.5710568281709, lng: 127.075113657819, title: "파랑새어린이집" },
      {
        lat: 37.5677702572124,
        lng: 127.058401410042,
        title: "파크자이어린이집",
      },
      {
        lat: 37.5642445787945,
        lng: 127.071488919715,
        title: "포르테몬테소리어린이집",
      },
      {
        lat: 37.5668181232225,
        lng: 127.072180369911,
        title: "푸른나무어린이집",
      },
      {
        lat: 37.5689435029739,
        lng: 127.066945172212,
        title: "푸른하늘어린이집",
      },
      { lat: 37.5728549565736, lng: 127.052401156065, title: "하랑어린이집" },
      {
        lat: 37.5950367073325,
        lng: 127.046322831171,
        title: "한국국방연구원 직장어린이집",
      },
      {
        lat: 37.5990520361954,
        lng: 127.057083059798,
        title: "한국외국어대학교어린이집",
      },
      { lat: 37.5961851201092, lng: 127.056631100192, title: "한빛어린이집" },
      { lat: 37.5880281566858, lng: 127.049226158581, title: "한신어린이집" },
      { lat: 37.5750720968253, lng: 127.074282139153, title: "한아름어린이집" },
      { lat: 37.5710568281709, lng: 127.075113657819, title: "한울어린이집" },
      { lat: 37.5717569033905, lng: 127.067660158684, title: "해리어린이집" },
      { lat: 37.5810844885174, lng: 127.072300899697, title: "해맑은어린이집" },
      { lat: 37.5832360364758, lng: 127.071898008969, title: "해솔어린이집" },
      { lat: 37.5840209857522, lng: 127.034196960692, title: "해오름어린이집" },
      { lat: 37.5832360364758, lng: 127.071898008969, title: "해찬어린이집" },
      {
        lat: 37.5648987351718,
        lng: 127.065042716716,
        title: "해피트리어린이집",
      },
      { lat: 37.5766590358858, lng: 127.061567688813, title: "햇님어린이집" },
      { lat: 37.5773472429026, lng: 127.064386983555, title: "햇빛어린이집" },
      { lat: 37.5728202499933, lng: 127.036978926783, title: "햇살어린이집" },
      {
        lat: 37.5754722861294,
        lng: 127.037112346823,
        title: "허브리츠어린이집",
      },
      {
        lat: 37.5763379008361,
        lng: 127.074572635161,
        title: "현대참사랑어린이집",
      },
      { lat: 37.5728549565736, lng: 127.052401156065, title: "호수어린이집" },
      {
        lat: 37.5783342071942,
        lng: 127.060438346864,
        title: "홀츠앤키즈어린이집",
      },
      {
        lat: 37.5918837104542,
        lng: 127.053708696779,
        title: "회기하나어린이집",
      },
      { lat: 37.5832360364758, lng: 127.071898008969, title: "효림어린이집" },
      {
        lat: 37.593701245652,
        lng: 127.064897703345,
        title: "휘경SK뷰어린이집",
      },
      {
        lat: 37.5914880558506,
        lng: 127.057776577597,
        title: "휘경스마일어린이집",
      },
      { lat: 37.5887655669609, lng: 127.058791788697, title: "휘경어린이집" },
      { lat: 37.5720742467292, lng: 127.047273509268, title: "휴사랑어린이집" },
      {
        lat: 37.5871742821863,
        lng: 127.069938991404,
        title: "서울특별시 동대문구 장안벚꽃로 323",
      },
      {
        lat: 37.5830461915113,
        lng: 127.048169864241,
        title: "꿈자람공동육아방 청량리점",
      },
      {
        lat: 37.5837210015443,
        lng: 127.034655235628,
        title: "꿈자람공동육아방 제기점",
      },
      {
        lat: 37.5862857103438,
        lng: 127.035156404234,
        title: "꿈자람공동육아방 제기2호점",
      },
      {
        lat: 37.5736571669728,
        lng: 127.067545846933,
        title: "꿈자람공동육아방 장안2호점",
      },
      {
        lat: 37.5723432877087,
        lng: 127.068567978354,
        title: "꿈자람공동육아방 장안1호점",
      },
      {
        lat: 37.5722901232255,
        lng: 127.029916868494,
        title: "꿈자람공동육아방 용신점",
      },
      {
        lat: 37.578443110427,
        lng: 127.06273508839,
        title: "꿈자람공동육아방 배봉산점",
      },
      {
        lat: 37.5720456892425,
        lng: 127.047933777839,
        title: "꿈자람공동육아방 답십리점",
      },
      {
        lat: 37.5749076420442,
        lng: 127.055085613697,
        title: "꿈자람공동육아방 답십리2호점",
      },
    ];
    markerPositions.forEach((loc) => {
      const position = new window.kakao.maps.LatLng(loc.lat, loc.lng);
      const content = `<div style="font-size: 24px;">💙</div>`;
      new window.kakao.maps.CustomOverlay({
        position,
        content,
        yAnchor: 1,
        map: newMap,
      });
    });

    // ❤️ 노인복지 마커
    const elderly = [
      { lat: 37.57829744, lng: 127.0421996 },
      { lat: 37.56663423, lng: 127.0683889 },
      { lat: 37.57716395, lng: 127.0358094 },
      { lat: 37.56670169, lng: 127.056713 },
      { lat: 37.57640519, lng: 127.0473915 },
      { lat: 37.56990735, lng: 127.0576235 },
      { lat: 37.57016097, lng: 127.0495161 },
      { lat: 37.58419171, lng: 127.0456969 },
      { lat: 37.58526339, lng: 127.0347349 },
      { lat: 37.58279487, lng: 127.0433833 },
      { lat: 37.57435891, lng: 127.031927 },
      { lat: 37.57415402, lng: 127.0451904 },
      { lat: 37.58751632, lng: 127.0427076 },
      { lat: 37.59025847, lng: 127.0620398 },
      { lat: 37.57922666, lng: 127.074006 },
      { lat: 37.58152415, lng: 127.0377483 },
      { lat: 37.5814977, lng: 127.0364792 },
      { lat: 37.57612882, lng: 127.0420167 },
      { lat: 37.5682068, lng: 127.0548 },
      { lat: 37.57675797, lng: 127.0248888 },
      { lat: 37.57631848, lng: 127.0665157 },
      { lat: 37.58936957, lng: 127.060972 },
      { lat: 37.5683536, lng: 127.0674649 },
      { lat: 37.58724711, lng: 127.0500267 },
      { lat: 37.58402099, lng: 127.034197 },
      { lat: 37.57728491, lng: 127.0301471 },
      { lat: 37.57228156, lng: 127.0695085 },
      { lat: 37.58294483, lng: 127.0437714 },
      { lat: 37.5842018, lng: 127.050552 },
      { lat: 37.57996239, lng: 127.068052 },
      { lat: 37.58621194, lng: 127.0635533 },
      { lat: 37.58607579, lng: 127.0420193 },
      { lat: 37.57473888, lng: 127.0325123 },
      { lat: 37.60315837, lng: 127.065295 },
      { lat: 37.5821361, lng: 127.0388933 },
      { lat: 37.57631749, lng: 127.0661948 },
      { lat: 37.5733599, lng: 127.0663218 },
      { lat: 37.57585054, lng: 127.044914 },
      { lat: 37.5862721, lng: 127.0339466 },
      { lat: 37.57298904, lng: 127.0699287 },
      { lat: 37.58646751, lng: 127.0410668 },
      { lat: 37.5837983, lng: 127.0383136 },
      { lat: 37.56864896, lng: 127.0632061 },
      { lat: 37.57600766, lng: 127.0714122 },
      { lat: 37.57549907, lng: 127.0709115 },
      { lat: 37.5786945, lng: 127.0564585 },
      { lat: 37.56570315, lng: 127.0671339 },
      { lat: 37.57017349, lng: 127.0576471 },
      { lat: 37.59848092, lng: 127.0618727 },
      { lat: 37.57125705, lng: 127.0694906 },
      { lat: 37.57512329, lng: 127.0488588 },
      { lat: 37.57268267, lng: 127.0589395 },
      { lat: 37.57276248, lng: 127.068801 },
      { lat: 37.57265459, lng: 127.0750703 },
      { lat: 37.58067787, lng: 127.0519176 },
      { lat: 37.58577859, lng: 127.0416619 },
      { lat: 37.57887851, lng: 127.0556411 },
      { lat: 37.56520017, lng: 127.0631218 },
      { lat: 37.6001268, lng: 127.0673903 },
      { lat: 37.57268283, lng: 127.0591464 },
      { lat: 37.57058465, lng: 127.0570303 },
    ];
    elderly.forEach((loc) => {
      const position = new window.kakao.maps.LatLng(loc.lat, loc.lng);
      const content = `<div style="font-size: 24px;">❤️</div>`;
      new window.kakao.maps.CustomOverlay({
        position,
        content,
        yAnchor: 1,
        map: newMap,
      });
    });

    // 🌳 가로수 마커
    const streetTreeMarkers: any[] = [];
    streetTree.forEach((tree) => {
      const position = new window.kakao.maps.LatLng(tree.lat, tree.lng);
      const content = `<div style="font-size: 20px; opacity: 0.2;">🌳</div>`;
      const overlay = new window.kakao.maps.CustomOverlay({
        position,
        content,
        yAnchor: 1,
      });
      overlay.setMap(newMap);
      streetTreeMarkers.push(overlay);
    });

    // 줌 변경 시 마커 다시 세팅
    window.kakao.maps.event.addListener(newMap, "zoom_changed", () => {
      streetTreeMarkers.forEach((overlay) => {
        overlay.setMap(newMap);
      });
    });
  };

  // 지도 크기 재조정
  useEffect(() => {
    if (map) {
      window.kakao.maps.event.addListener(map, "tilesloaded", () => {
        map.relayout();
      });
    }
  }, [map]);

  // 카카오 스크립트 로드되면 지도 초기화
  useEffect(() => {
    if (isLoaded && !map && streetTree.length > 0) {
      window.kakao.maps.load(() => {
        initMap();
      });
    }
  }, [isLoaded, map, streetTree]);

  return (
    <div>
      <Script
        src={`https://dapi.kakao.com/v2/maps/sdk.js?appkey=${process.env.NEXT_PUBLIC_KAKAOMAP_API_KEY}&autoload=false`}
        strategy="afterInteractive"
        onLoad={() => setIsLoaded(true)}
      />
      <div
        className="map-container"
        id="map"
        style={{ width: "100%", height: "90vh" }}
      ></div>
    </div>
  );
}
